# StairsPathPositionResetWarning Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..StairsPathPositionResetWarning Property
BuiltInFailures..::..StairRampFailures Class See Also
---
The stairs path doesn't intersect with riser lines.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId StairsPathPositionResetWarning { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsPathPositionResetWarning As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ StairsPathPositionResetWarning {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace